Test/TrimFuel.WebServices.Test/DirectActionSOAP_CreateSubscription.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><CreateSubscription xmlns="http://trianglecrm.com/"><username>directaction</username><password>dew9JKq2az</password><ChargeForTrial>false</ChargeForTrial><planID>368</planID><firstName>TestAccount</firstName><lastName>TestAccount</lastName><address1>Test</address1><address2>Test</address2><city>Test</city><state>NM</state><zip>00000</zip><phone>0000000000</phone><email>dtcoder@gmail.com</email><ip>127.0.0.1</ip><affiliate></affiliate><subAffiliate></subAffiliate><internalID>TestInternalID2</internalID><paymentType>2</paymentType><creditCard>4111111111111112</creditCard><cvv>000</cvv><expMonth>03</expMonth><expYear>2014</expYear></CreateSubscription></soap:Body></soap:Envelope>